{
  "module": "accessibility",
  "version": "1.0.0",
  "checks": [
    {
      "id": "a11y-001",
      "legacy_id": "a11q1",
      "module": "accessibility",
      "subcategory": "visual",
      "question_nl": "Heeft de body tekst voldoende contrast? (WCAG AA: 4.5:1 ratio)",
      "question_en": "Does the body text have sufficient contrast? (WCAG AA: 4.5:1 ratio)",
      "type": "auto",
      "severity": "critical",
      "business_impact_nl": "Onvoldoende contrast maakt tekst onleesbaar voor gebruikers met laag zicht of kleurenblindheid, wat leidt tot lage gebruiksgraad.",
      "business_impact_en": "Insufficient contrast makes text unreadable for users with low vision or color blindness, leading to low engagement.",
      "fix_suggestion_nl": "Verhoog de contrastverhouding van tekst en achtergrond tot minstens 4.5:1 voor normale tekst en 3:1 voor grote tekst.",
      "fix_suggestion_en": "Increase the contrast ratio between text and background to at least 4.5:1 for normal text and 3:1 for large text.",
      "effort": "low",
      "applicable_to": ["all"],
      "auto_tool": "axe-core",
      "auto_rule": "color-contrast"
    },
    {
      "id": "a11y-002",
      "legacy_id": "a11q2",
      "module": "accessibility",
      "subcategory": "visual",
      "question_nl": "Hebben knoppen en links voldoende contrast met hun achtergrond?",
      "question_en": "Do buttons and links have sufficient contrast with their background?",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Slecht contrast op knoppen en links verhindert gebruikers om interactieve elementen te identificeren en kan tot frustatie leiden.",
      "business_impact_en": "Poor contrast on buttons and links prevents users from identifying interactive elements and causes frustration.",
      "fix_suggestion_nl": "Zorg ervoor dat alle knoppen en links een contrastverhouding van minstens 3:1 hebben ten opzichte van de achtergrond.",
      "fix_suggestion_en": "Ensure all buttons and links have a contrast ratio of at least 3:1 against their background.",
      "effort": "low",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-003",
      "legacy_id": "a11q3",
      "module": "accessibility",
      "subcategory": "visual",
      "question_nl": "Is placeholder tekst in formulieren leesbaar? (vaak te licht)",
      "question_en": "Is placeholder text in forms readable? (often too light)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Te lichter placeholder-tekst is moeilijk te lezen, wat gebruikers verwarring geeft over wat ze moeten invullen.",
      "business_impact_en": "Light placeholder text is hard to read, confusing users about what to fill in.",
      "fix_suggestion_nl": "Gebruik een contrastverhouding van minstens 4.5:1 voor placeholder-tekst en zorg dat deze niet verdwijnt wanneer gebruikers beginnen in te typen.",
      "fix_suggestion_en": "Use a contrast ratio of at least 4.5:1 for placeholder text and ensure it doesn't disappear when users start typing.",
      "effort": "low",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-004",
      "legacy_id": "a11q4",
      "module": "accessibility",
      "subcategory": "visual",
      "question_nl": "Is tekst op afbeeldingen/banners leesbaar? (overlay contrast)",
      "question_en": "Is text on images/banners readable? (overlay contrast)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Onleesbare tekst op afbeeldingen verhindert gebruikers essentiële informatie te begrijpen, wat conversies negatief beïnvloedt.",
      "business_impact_en": "Unreadable text on images prevents users from understanding essential information, negatively affecting conversions.",
      "fix_suggestion_nl": "Voeg een semi-transparant overlay toe achter tekst op afbeeldingen of kies afbeeldingen met beter contrast. Minimaal 4.5:1 contrastverhouding.",
      "fix_suggestion_en": "Add a semi-transparent overlay behind text on images or choose images with better contrast. Minimum 4.5:1 contrast ratio.",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-005",
      "legacy_id": "a11q5",
      "module": "accessibility",
      "subcategory": "visual",
      "question_nl": "Wordt kleur niet als enige middel gebruikt om info over te brengen?",
      "question_en": "Is color not used as the only means of conveying information?",
      "type": "manual",
      "severity": "critical",
      "business_impact_nl": "Afhankelijkheid van alleen kleur voor informatieoverdracht maakt het onmogelijk voor kleurenblinde gebruikers het begrip te verkrijgen.",
      "business_impact_en": "Relying on color alone for information makes it impossible for colorblind users to understand.",
      "fix_suggestion_nl": "Gebruik tekstlabels, symbolen, patronen of andere visuele indicatoren in plaats van alleen kleur. Bijvoorbeeld: rood + 'fout' tekst in plaats van alleen rood.",
      "fix_suggestion_en": "Use text labels, symbols, patterns, or other visual indicators instead of color alone. For example: red + 'error' text instead of red only.",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-006",
      "legacy_id": "a11q6",
      "module": "accessibility",
      "subcategory": "visual",
      "question_nl": "Zijn focus-states duidelijk zichtbaar voor toetsenbordnavigatie?",
      "question_en": "Are focus states clearly visible for keyboard navigation?",
      "type": "manual",
      "severity": "critical",
      "business_impact_nl": "Onduidelijke focus-states maken het onmogelijk voor toetsenbordgebruikers hun locatie op de pagina te bepalen.",
      "business_impact_en": "Unclear focus states make it impossible for keyboard users to determine their location on the page.",
      "fix_suggestion_nl": "Voeg een duidelijke visuele focus-indicator toe (bijv. outline, highlight, background-change) met een contrastverhouding van minstens 3:1.",
      "fix_suggestion_en": "Add a clear visual focus indicator (e.g., outline, highlight, background change) with at least 3:1 contrast ratio.",
      "effort": "low",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-007",
      "legacy_id": "a11q7",
      "module": "accessibility",
      "subcategory": "visual",
      "question_nl": "Is de tekst minstens 16px en de regelafstand minstens 1.5?",
      "question_en": "Is text at least 16px and line spacing at least 1.5?",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Te kleine tekst en regelafstand maken lang lezen vermoeiend, vooral voor ouderen en gebruikers met leesbeperkingen.",
      "business_impact_en": "Text that's too small and tight line spacing makes extended reading tiring, especially for elderly users and those with dyslexia.",
      "fix_suggestion_nl": "Stel base-tekstgrootte in op minstens 16px en regelafstand (line-height) op minstens 1.5 voor normale paragrafen.",
      "fix_suggestion_en": "Set base text size to at least 16px and line-height to at least 1.5 for normal paragraphs.",
      "effort": "low",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-008",
      "legacy_id": "kb1",
      "module": "accessibility",
      "subcategory": "keyboard",
      "question_nl": "Is alle functionaliteit bereikbaar met alleen het toetsenbord? (WCAG 2.1.1)",
      "question_en": "Is all functionality accessible with keyboard only? (WCAG 2.1.1)",
      "type": "manual",
      "severity": "critical",
      "business_impact_nl": "Toetsenbord-ontoegankelijkheid sluit gebruikers met motorische beperkingen of assistivetechnologieën uit.",
      "business_impact_en": "Keyboard inaccessibility excludes users with motor disabilities or assistive technologies.",
      "fix_suggestion_nl": "Zorg dat alle knoppen, links, formuliervelden en andere interactieve elementen bereikbaar zijn en activeerbaar met Tab, Enter en andere toetsenbordcommando's.",
      "fix_suggestion_en": "Ensure all buttons, links, form fields, and interactive elements are reachable and activatable with Tab, Enter, and other keyboard commands.",
      "effort": "high",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-009",
      "legacy_id": "kb2",
      "module": "accessibility",
      "subcategory": "keyboard",
      "question_nl": "Kan de gebruiker nergens vast komen te zitten met het toetsenbord? Geen keyboard traps? (WCAG 2.1.2)",
      "question_en": "Can the user get stuck with keyboard? No keyboard traps? (WCAG 2.1.2)",
      "type": "manual",
      "severity": "critical",
      "business_impact_nl": "Keyboard traps voelen als browser hangt/crashed voor toetsenbordgebruikers, resulterend in verlaten van de site.",
      "business_impact_en": "Keyboard traps feel like the browser is frozen for keyboard users, resulting in site abandonment.",
      "fix_suggestion_nl": "Test alle interactieve elementen met alleen Tab/Shift+Tab. Zorg dat focus altijd kan bewegen. Vermijd JavaScript-baseerde focus-locks zonder escape-optie.",
      "fix_suggestion_en": "Test all interactive elements with Tab/Shift+Tab only. Ensure focus can always move forward/backward. Avoid JavaScript-based focus locks without escape option.",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-010",
      "legacy_id": "kb3",
      "module": "accessibility",
      "subcategory": "keyboard",
      "question_nl": "Is er een 'Skip to content' link aanwezig om navigatie over te slaan? (WCAG 2.4.1)",
      "question_en": "Is there a 'Skip to content' link to bypass navigation? (WCAG 2.4.1)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Zonder skip-link moeten toetsenbordgebruikers door heel navigatiemenu's tabben voor ze bij inhoud komen, wat navigatie vertraagt.",
      "business_impact_en": "Without skip link, keyboard users must tab through entire navigation menus before reaching content, slowing navigation.",
      "fix_suggestion_nl": "Voeg een 'Skip to main content' link toe als eerste interactief element op de pagina, zichtbaar bij Tab-focus, verborgen voor muis-gebruikers.",
      "fix_suggestion_en": "Add a 'Skip to main content' link as the first interactive element, visible on Tab focus, hidden for mouse users.",
      "effort": "low",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-011",
      "legacy_id": "kb4",
      "module": "accessibility",
      "subcategory": "keyboard",
      "question_nl": "Heeft elke pagina een beschrijvende, unieke <title>? (WCAG 2.4.2)",
      "question_en": "Does each page have a descriptive, unique <title>? (WCAG 2.4.2)",
      "type": "auto",
      "severity": "important",
      "business_impact_nl": "Generieke pagina-titels helpen toetsenbord- en schermlezer-gebruikers niet om hun locatie te begrijpen.",
      "business_impact_en": "Generic page titles don't help keyboard and screen reader users understand their location.",
      "fix_suggestion_nl": "Voeg unieke, beschrijvende titels toe aan elke pagina in de <title> tag. Bv: 'Contactformulier - Mijn Bedrijf' in plaats van 'Home'.",
      "fix_suggestion_en": "Add unique, descriptive titles to each page in the <title> tag. E.g., 'Contact Form - My Business' instead of 'Home'.",
      "effort": "low",
      "applicable_to": ["all"],
      "auto_tool": "axe-core",
      "auto_rule": "document-title"
    },
    {
      "id": "a11y-012",
      "legacy_id": "kb5",
      "module": "accessibility",
      "subcategory": "keyboard",
      "question_nl": "Is de tab-volgorde logisch en voorspelbaar? (WCAG 2.4.3)",
      "question_en": "Is the tab order logical and predictable? (WCAG 2.4.3)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Chaotische tab-volgorde verwart toetsenbordgebruikers en maakt navigatie inefficiënt.",
      "business_impact_en": "Chaotic tab order confuses keyboard users and makes navigation inefficient.",
      "fix_suggestion_nl": "Zorg dat de tab-volgorde volgt: van boven naar beneden, links naar rechts, in dezelfde volgorde als visuele layout. Vermijd tabindex > 0.",
      "fix_suggestion_en": "Ensure tab order follows: top to bottom, left to right, in same order as visual layout. Avoid tabindex > 0.",
      "effort": "low",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-013",
      "legacy_id": "kb6",
      "module": "accessibility",
      "subcategory": "keyboard",
      "question_nl": "Zijn er meerdere manieren om paginas te vinden? (menu, zoekfunctie, sitemap) (WCAG 2.4.5)",
      "question_en": "Are there multiple ways to find pages? (menu, search, sitemap) (WCAG 2.4.5)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Gebruikers kunnen pagina's niet vinden via navigatiemenu, zoekfunctie, of sitemap, wat leidt tot frustratie en lage engagement.",
      "business_impact_en": "Users cannot find pages via navigation menu, search function, or sitemap, leading to frustration and low engagement.",
      "fix_suggestion_nl": "Implementeer minimaal 2-3 manieren om pagina's te vinden: navigatiemenu, zoekfunctie, sitemap, breadcrumbs, of gerelateerde links.",
      "fix_suggestion_en": "Implement at least 2-3 ways to find pages: navigation menu, search function, sitemap, breadcrumbs, or related links.",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-014",
      "legacy_id": "kb7",
      "module": "accessibility",
      "subcategory": "keyboard",
      "question_nl": "Is de focus-indicator altijd duidelijk zichtbaar bij toetsenbordnavigatie? (WCAG 2.4.7)",
      "question_en": "Is the focus indicator always clearly visible during keyboard navigation? (WCAG 2.4.7)",
      "type": "manual",
      "severity": "critical",
      "business_impact_nl": "Onzichtbare focus-indicator maakt het onmogelijk voor toetsenbordgebruikers te volgen waar ze zijn op pagina.",
      "business_impact_en": "Invisible focus indicator makes it impossible for keyboard users to track where they are on the page.",
      "fix_suggestion_nl": "Zorg dat alle elementen een zichtbare focus-indicator hebben (outline, highlight, etc.) met contrastverhouding ≥3:1. Verwijder nooit de browser-default focus zonder custom replacement.",
      "fix_suggestion_en": "Ensure all elements have visible focus indicator (outline, highlight, etc.) with contrast ratio ≥3:1. Never remove browser-default focus without custom replacement.",
      "effort": "low",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-015",
      "legacy_id": "md1",
      "module": "accessibility",
      "subcategory": "media",
      "question_nl": "Hebben audio-only bestanden een teksttranscriptie? (WCAG 1.2.1)",
      "question_en": "Do audio-only files have text transcripts? (WCAG 1.2.1)",
      "type": "manual",
      "severity": "critical",
      "business_impact_nl": "Zonder transcriptie kunnen doven en slechthorenden audio-inhoud niet begrijpen.",
      "business_impact_en": "Without transcripts, deaf and hard of hearing users cannot access audio content.",
      "fix_suggestion_nl": "Zorg dat alle audio-only bestanden vergezeld gaan van volledige teksttranscripties. Plaats deze naast of onder de audioplayerof downloadbaar.",
      "fix_suggestion_en": "Ensure all audio-only files are accompanied by complete text transcripts. Place alongside or below the player or downloadable.",
      "effort": "high",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-016",
      "legacy_id": "md2",
      "module": "accessibility",
      "subcategory": "media",
      "question_nl": "Hebben videos ondertiteling (captions)? (WCAG 1.2.2)",
      "question_en": "Do videos have captions? (WCAG 1.2.2)",
      "type": "auto",
      "severity": "critical",
      "business_impact_nl": "Zonder ondertiteling kunnen doven en slechthorenden videocontent niet volgen.",
      "business_impact_en": "Without captions, deaf and hard of hearing users cannot follow video content.",
      "fix_suggestion_nl": "Voeg synchronized ondertitels toe aan alle video's, inclusief spraakinformatie en relevante geluidseffecten (bijv. [deur slaat dicht]).",
      "fix_suggestion_en": "Add synchronized captions to all videos, including speech and relevant sound effects (e.g., [door slams]).",
      "effort": "high",
      "applicable_to": ["all"],
      "auto_tool": "axe-core",
      "auto_rule": "video-caption"
    },
    {
      "id": "a11y-017",
      "legacy_id": "md3",
      "module": "accessibility",
      "subcategory": "media",
      "question_nl": "Is er een audiodescriptie of tekst-alternatief voor video-inhoud? (WCAG 1.2.3 / 1.2.5)",
      "question_en": "Is there audio description or text alternative for video content? (WCAG 1.2.3 / 1.2.5)",
      "type": "manual",
      "severity": "critical",
      "business_impact_nl": "Blinde en slechtziende gebruikers missen kritieke visuele informatie zonder audiodescriptie.",
      "business_impact_en": "Blind and low vision users miss critical visual information without audio description.",
      "fix_suggestion_nl": "Voeg audiodescriptie toe aan alle video's met belangrijk visueel content. Maak dit beschikbaar als apart audiotrack, separate MP3, of teksttranscriptie.",
      "fix_suggestion_en": "Add audio description to all videos with important visual content. Make available as separate audio track, separate MP3, or text transcript.",
      "effort": "high",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-018",
      "legacy_id": "md4",
      "module": "accessibility",
      "subcategory": "media",
      "question_nl": "Hebben live video-uitzendingen ondertiteling? (WCAG 1.2.4)",
      "question_en": "Do live video broadcasts have captions? (WCAG 1.2.4)",
      "type": "manual",
      "severity": "critical",
      "business_impact_nl": "Live content zonder ondertiteling maakt het onmogelijk voor slechthorenden deel te nemen.",
      "business_impact_en": "Live content without captions makes it impossible for hard of hearing users to participate.",
      "fix_suggestion_nl": "Implementeer real-time ondertiteling voor alle live-uitzendingen, bijv. via CART (Communication Access Realtime Translation) of live-caption tools.",
      "fix_suggestion_en": "Implement real-time captioning for all live broadcasts, e.g., via CART or live-caption tools.",
      "effort": "high",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-019",
      "legacy_id": "md5",
      "module": "accessibility",
      "subcategory": "media",
      "question_nl": "Kan audio die automatisch afspeelt gepauzeerd of gedempt worden? (WCAG 1.4.2)",
      "question_en": "Can auto-playing audio be paused or muted? (WCAG 1.4.2)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Auto-afspeelend geluid is storend en kan schermlezer-audio overstemmen, wat navigatie bemoeilijkt.",
      "business_impact_en": "Auto-playing audio is disruptive and can drown out screen reader audio, hindering navigation.",
      "fix_suggestion_nl": "Vermijd auto-afspeelend geluid. Als nodig, zorg dat gebruikers het kunnen pauzeren/dempen zonder pagina te herladen. Beter: geen autoplay in het geheel.",
      "fix_suggestion_en": "Avoid auto-playing audio. If necessary, let users pause/mute without reloading page. Better: no autoplay at all.",
      "effort": "low",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-020",
      "legacy_id": "md6",
      "module": "accessibility",
      "subcategory": "media",
      "question_nl": "Kan de gebruiker tijdslimieten verlengen, uitschakelen of aanpassen? (WCAG 2.2.1)",
      "question_en": "Can the user extend, disable, or adjust time limits? (WCAG 2.2.1)",
      "type": "manual",
      "severity": "critical",
      "business_impact_nl": "Vaste tijdslimieten zonder verlengingsmogelijkheid sluiten gebruikers met motorische of cognitieve beperkingen uit.",
      "business_impact_en": "Fixed time limits without extension options exclude users with motor or cognitive disabilities.",
      "fix_suggestion_nl": "Verwijder of verberg automatische sessie-timeouts. Als nodig, geef gebruikers minstens 10 seconden waarschuwing en een optie om de timeout met minstens 10x in te stellen.",
      "fix_suggestion_en": "Remove or hide automatic session timeouts. If necessary, warn users at least 10 seconds before and offer option to extend by at least 10x.",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-021",
      "legacy_id": "md7",
      "module": "accessibility",
      "subcategory": "media",
      "question_nl": "Kan bewegende, knipperende of auto-scrollende content gepauzeerd worden? (WCAG 2.2.2)",
      "question_en": "Can moving, blinking, or auto-scrolling content be paused? (WCAG 2.2.2)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Bewegende content kan afleidend zijn en seizoens-gerelateerde storingen veroorzaken bij gevoelige gebruikers.",
      "business_impact_en": "Moving content can be distracting and trigger motion sickness in susceptible users.",
      "fix_suggestion_nl": "Voeg pause/play knoppen toe aan carousels, animaties en auto-scroll features. Laat content maar 5 seconden bewegen zonder pauzeknop.",
      "fix_suggestion_en": "Add pause/play buttons to carousels, animations, and auto-scroll features. Allow content to move only 5 seconds without pause option.",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-022",
      "legacy_id": "md8",
      "module": "accessibility",
      "subcategory": "media",
      "question_nl": "Bevat de pagina geen content die meer dan 3x per seconde flitst? (WCAG 2.3.1)",
      "question_en": "Does the page contain no content flashing more than 3 times per second? (WCAG 2.3.1)",
      "type": "manual",
      "severity": "critical",
      "business_impact_nl": "Flitsende content kan fotosensitieve epilepsie-aanvallen veroorzaken.",
      "business_impact_en": "Flashing content can trigger photosensitive epilepsy seizures.",
      "fix_suggestion_nl": "Vermijd alle flitsende/knipperende content boven 3Hz (3x per seconde). Als nodig, zorg dat flitsing minder dan 25% schermoppervlak inneemt.",
      "fix_suggestion_en": "Avoid all flashing/blinking content above 3Hz (3 times per second). If necessary, ensure flashing occupies less than 25% of screen area.",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-023",
      "legacy_id": "fm1",
      "module": "accessibility",
      "subcategory": "forms",
      "question_nl": "Heeft elk formulierveld een zichtbaar en gekoppeld <label>? (WCAG 3.3.2 / 1.3.1)",
      "question_en": "Does each form field have a visible and associated <label>? (WCAG 3.3.2 / 1.3.1)",
      "type": "auto",
      "severity": "critical",
      "business_impact_nl": "Zonder gekoppelde labels kunnen schermlezer-gebruikers niet begrijpen wat elk veld is.",
      "business_impact_en": "Without associated labels, screen reader users cannot understand what each field is.",
      "fix_suggestion_nl": "Voeg <label> elementen toe met for-attribuut dat overeenkomt met input id. Zorg dat labels zichtbaar zijn en beschrijvend zijn.",
      "fix_suggestion_en": "Add <label> elements with for attribute matching input id. Ensure labels are visible and descriptive.",
      "effort": "low",
      "applicable_to": ["all"],
      "auto_tool": "axe-core",
      "auto_rule": "label"
    },
    {
      "id": "a11y-024",
      "legacy_id": "fm2",
      "module": "accessibility",
      "subcategory": "forms",
      "question_nl": "Worden fouten duidelijk geidentificeerd en in tekst beschreven? (WCAG 3.3.1)",
      "question_en": "Are errors clearly identified and described in text? (WCAG 3.3.1)",
      "type": "manual",
      "severity": "critical",
      "business_impact_nl": "Onduidelijke foutmeldingen frustreren gebruikers en leiden tot verlaten van formulier.",
      "business_impact_en": "Unclear error messages frustrate users and lead to form abandonment.",
      "fix_suggestion_nl": "Toon foutmeldingen duidelijk in tekst (niet alleen rood/pictogram). Identificeer het veld en leg uit wat fout is. Bv: 'Email veld: voer een geldig e-mailadres in'.",
      "fix_suggestion_en": "Display errors clearly in text (not just red/icon). Identify the field and explain what's wrong. E.g., 'Email field: enter a valid email address'.",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-025",
      "legacy_id": "fm3",
      "module": "accessibility",
      "subcategory": "forms",
      "question_nl": "Worden suggesties gegeven bij invoerfouten? (WCAG 3.3.3)",
      "question_en": "Are suggestions provided for input errors? (WCAG 3.3.3)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Zonder suggesties moeten gebruikers gissen hoe fouten op te lossen, wat frustratie verhoogt.",
      "business_impact_en": "Without suggestions, users must guess how to fix errors, increasing frustration.",
      "fix_suggestion_nl": "Geef nuttige suggesties voor het corrigeren van fouten. Bv: 'Voer datum in als DD-MM-YYYY' of 'Wachtwoord moet minstens 8 tekens bevatten'.",
      "fix_suggestion_en": "Provide helpful suggestions for correcting errors. E.g., 'Enter date as DD-MM-YYYY' or 'Password must contain at least 8 characters'.",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-026",
      "legacy_id": "fm4",
      "module": "accessibility",
      "subcategory": "forms",
      "question_nl": "Kunnen juridische/financiele acties ongedaan gemaakt, gecontroleerd of bevestigd worden? (WCAG 3.3.4)",
      "question_en": "Can legal/financial actions be undone, checked, or confirmed? (WCAG 3.3.4)",
      "type": "manual",
      "severity": "critical",
      "business_impact_nl": "Onherstelbare juridische/financiële fouten kunnen gebruikers schaden en aansprakelijkheid voor bedrijf creëren.",
      "business_impact_en": "Irreversible legal/financial mistakes can harm users and create liability.",
      "fix_suggestion_nl": "Implementeer bevestigingsdialogen, preview schermen, of undo-opties voor kritische acties (betaling, verwijdering, etc.). Zorg voor duidelijke beweringen.",
      "fix_suggestion_en": "Implement confirmation dialogs, preview screens, or undo options for critical actions (payment, deletion, etc.). Provide clear statements.",
      "effort": "high",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-027",
      "legacy_id": "fm5",
      "module": "accessibility",
      "subcategory": "forms",
      "question_nl": "Heeft de HTML-pagina een correct lang-attribuut? (bijv. lang='nl') (WCAG 3.1.1)",
      "question_en": "Does the HTML page have a correct lang attribute? (e.g., lang='nl') (WCAG 3.1.1)",
      "type": "auto",
      "severity": "important",
      "business_impact_nl": "Zonder correct lang-attribuut kunnen schermlezers niet de juiste uitspraak gebruiken.",
      "business_impact_en": "Without correct lang attribute, screen readers cannot use proper pronunciation.",
      "fix_suggestion_nl": "Voeg lang='nl' (of appropriate language code) toe aan de <html> tag.",
      "fix_suggestion_en": "Add lang='nl' (or appropriate language code) to the <html> tag.",
      "effort": "low",
      "applicable_to": ["all"],
      "auto_tool": "axe-core",
      "auto_rule": "html-has-lang"
    },
    {
      "id": "a11y-028",
      "legacy_id": "fm6",
      "module": "accessibility",
      "subcategory": "forms",
      "question_nl": "Worden wisselingen van taal in de content gemarkeerd met lang-attribuut? (WCAG 3.1.2)",
      "question_en": "Are language changes in content marked with lang attribute? (WCAG 3.1.2)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Ongemarkeerde taalachtergrond zorgt ervoor dat schermlezers verkeerde uitspraak gebruiken.",
      "business_impact_en": "Unmarked language changes cause screen readers to use incorrect pronunciation.",
      "fix_suggestion_nl": "Markeer passages in andere talen met lang-attribuut. Bv: <span lang='en'>Hello</span> in Nederlandse tekst.",
      "fix_suggestion_en": "Mark passages in other languages with lang attribute. E.g., <span lang='en'>Hello</span> within Dutch text.",
      "effort": "low",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-029",
      "legacy_id": "fm7",
      "module": "accessibility",
      "subcategory": "forms",
      "question_nl": "Zijn verplichte velden duidelijk aangegeven (niet alleen met kleur)? (WCAG 1.3.1)",
      "question_en": "Are required fields clearly indicated (not color alone)? (WCAG 1.3.1)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Zonder duidelijke indicatie missen gebruikers welke velden verplicht zijn, resulterend in formuliervalidatiefouten.",
      "business_impact_en": "Without clear indication, users miss which fields are required, resulting in form validation errors.",
      "fix_suggestion_nl": "Voeg asterisk (*) of 'verplicht' tekstlabel toe naast verplichte velden. Zorg dat dit niet alleen via kleur is aangegeven.",
      "fix_suggestion_en": "Add asterisk (*) or 'required' text label next to required fields. Ensure not indicated by color alone.",
      "effort": "low",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-030",
      "legacy_id": "fm8",
      "module": "accessibility",
      "subcategory": "forms",
      "question_nl": "Worden instructies gegeven voor het formulier waar nodig? (WCAG 3.3.2)",
      "question_en": "Are instructions provided for the form where needed? (WCAG 3.3.2)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Onduidelijke formulierinterfaces frustreren gebruikers en leiden tot verlaten.",
      "business_impact_en": "Unclear form interfaces frustrate users and lead to abandonment.",
      "fix_suggestion_nl": "Voeg instructies toe boven het formulier of bij complexe velden. Leg uit wat verwacht wordt. Bv: 'Datum moet DD/MM/YYYY zijn'.",
      "fix_suggestion_en": "Add instructions above the form or for complex fields. Explain what's expected. E.g., 'Date must be DD/MM/YYYY'.",
      "effort": "low",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-031",
      "legacy_id": "sm1",
      "module": "accessibility",
      "subcategory": "semantics",
      "question_nl": "Is de heading-hierarchie logisch (h1 → h2 → h3)? (WCAG 1.3.1)",
      "question_en": "Is the heading hierarchy logical (h1 → h2 → h3)? (WCAG 1.3.1)",
      "type": "auto",
      "severity": "important",
      "business_impact_nl": "Onlogische heading-structuur maakt pagina-inhoud moeilijk te navigeren voor schermlezer-gebruikers.",
      "business_impact_en": "Illogical heading structure makes page content difficult to navigate for screen reader users.",
      "fix_suggestion_nl": "Zorg dat er één H1 per pagina is en dat headings in logische volgorde gaan. Sla niveaus niet over (h1 → h3).",
      "fix_suggestion_en": "Ensure one H1 per page and headings follow logical order. Don't skip levels (h1 → h3).",
      "effort": "low",
      "applicable_to": ["all"],
      "auto_tool": "axe-core",
      "auto_rule": "heading-order"
    },
    {
      "id": "a11y-032",
      "legacy_id": "sm2",
      "module": "accessibility",
      "subcategory": "semantics",
      "question_nl": "Hebben alle interactieve elementen een toegankelijke naam? (WCAG 4.1.2)",
      "question_en": "Do all interactive elements have an accessible name? (WCAG 4.1.2)",
      "type": "auto",
      "severity": "critical",
      "business_impact_nl": "Naamloze knoppen en links zijn onnavigeerbaar voor schermlezer-gebruikers.",
      "business_impact_en": "Unlabeled buttons and links are unnavigable for screen reader users.",
      "fix_suggestion_nl": "Zorg dat alle knoppen label-tekst hebben (via <button>, aria-label, of title). Links moet link-tekst hebben.",
      "fix_suggestion_en": "Ensure all buttons have label text (via <button>, aria-label, or title). Links must have link text.",
      "effort": "low",
      "applicable_to": ["all"],
      "auto_tool": "axe-core",
      "auto_rule": "button-name"
    },
    {
      "id": "a11y-033",
      "legacy_id": "sm3",
      "module": "accessibility",
      "subcategory": "semantics",
      "question_nl": "Zijn ARIA-rollen correct gebruikt? (WCAG 4.1.2)",
      "question_en": "Are ARIA roles used correctly? (WCAG 4.1.2)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Onjuiste ARIA-rollen verwarden schermlezers en geven gebruikers misleidende informatie.",
      "business_impact_en": "Incorrect ARIA roles confuse screen readers and give users misleading information.",
      "fix_suggestion_nl": "Gebruik ARIA-rollen alleen als nodig. Zorg dat rollen passen bij het element. Test met schermlezer.",
      "fix_suggestion_en": "Use ARIA roles only when necessary. Ensure roles match the element. Test with screen reader.",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-034",
      "legacy_id": "sm4",
      "module": "accessibility",
      "subcategory": "semantics",
      "question_nl": "Is de volgorde van content in de DOM logisch, ook zonder CSS? (WCAG 1.3.2)",
      "question_en": "Is the content order in the DOM logical, even without CSS? (WCAG 1.3.2)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Logische DOM-volgorde is essentieel voor toetsenbord en schermlezer navigatie.",
      "business_impact_en": "Logical DOM order is essential for keyboard and screen reader navigation.",
      "fix_suggestion_nl": "Zorg dat DOM-volgorde leesbaar is van boven naar beneden zonder CSS. Vermijd grote floats/absolute positioning die DOM-orde verstoren.",
      "fix_suggestion_en": "Ensure DOM order is readable top-to-bottom without CSS. Avoid large floats/absolute positioning that disrupts DOM order.",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-035",
      "legacy_id": "sm5",
      "module": "accessibility",
      "subcategory": "semantics",
      "question_nl": "Werkt de layout correct bij 200% zoom zonder horizontaal scrollen? (WCAG 1.4.4 / 1.4.10)",
      "question_en": "Does the layout work correctly at 200% zoom without horizontal scrolling? (WCAG 1.4.4 / 1.4.10)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Layouts die niet schalen bij zoom zijn onbruikbaar voor gebruikers met laag zicht.",
      "business_impact_en": "Layouts that don't scale at zoom are unusable for low vision users.",
      "fix_suggestion_nl": "Test de site bij 200% browser zoom. Zorg dat content niet horizontaal scrollt. Gebruik responsive design en relative units (em, %).",
      "fix_suggestion_en": "Test the site at 200% browser zoom. Ensure content doesn't require horizontal scrolling. Use responsive design and relative units.",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-036",
      "legacy_id": "sm6",
      "module": "accessibility",
      "subcategory": "semantics",
      "question_nl": "Verdwijnt content die verschijnt bij hover/focus niet onverwacht? (WCAG 1.4.13)",
      "question_en": "Does content appearing on hover/focus not disappear unexpectedly? (WCAG 1.4.13)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Content die verdwijnt op move/blur frustreert gebruikers die tooltips willen lezen.",
      "business_impact_en": "Content that disappears on move/blur frustrates users trying to read tooltips.",
      "fix_suggestion_nl": "Zorg dat hover/focus-content blijft totdat gebruiker het wegbeweegt of Escape drukt. Maak tooltips groot genoeg om mee te interacteren.",
      "fix_suggestion_en": "Ensure hover/focus content persists until user moves away or presses Escape. Make tooltips large enough to interact with.",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-037",
      "legacy_id": "sm7",
      "module": "accessibility",
      "subcategory": "semantics",
      "question_nl": "Hebben formuliervelden autocomplete-attributen? (WCAG 1.3.5)",
      "question_en": "Do form fields have autocomplete attributes? (WCAG 1.3.5)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Zonder autocomplete-hints kunnen gebruikers met motorische beperkingen formulieren niet efficiënt invullen.",
      "business_impact_en": "Without autocomplete hints, users with motor disabilities cannot efficiently fill forms.",
      "fix_suggestion_nl": "Voeg autocomplete-attributen toe aan formuliervelden (name, email, tel, etc.) zodat browsers autofill kunnen gebruiken.",
      "fix_suggestion_en": "Add autocomplete attributes to form fields (name, email, tel, etc.) so browsers can use autofill.",
      "effort": "low",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-038",
      "legacy_id": "sm8",
      "module": "accessibility",
      "subcategory": "semantics",
      "question_nl": "Werkt de content in zowel portrait als landscape modus? (WCAG 1.3.4)",
      "question_en": "Does content work in both portrait and landscape orientation? (WCAG 1.3.4)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Content geblokkeerd op één orientatie sluit gebruikers uit die hun apparaat anders houden.",
      "business_impact_en": "Content locked to one orientation excludes users who hold their device differently.",
      "fix_suggestion_nl": "Zorg dat content in beide orientaties werkt. Dwing geen specifieke orientatie af (tenzij essentieel, bijv. video-speler).",
      "fix_suggestion_en": "Ensure content works in both orientations. Don't force specific orientation (unless essential, e.g., video player).",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-039",
      "legacy_id": "sm9",
      "module": "accessibility",
      "subcategory": "semantics",
      "question_nl": "Zijn complexe gebaren ook beschikbaar via single-pointer alternatief? (WCAG 2.5.1)",
      "question_en": "Are complex gestures available via single-pointer alternative? (WCAG 2.5.1)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Indien alleen multi-touch gebaren beschikbaar, kunnen gebruikers met één hand of adaptieve controllers niet interacteren.",
      "business_impact_en": "If only multi-touch gestures are available, users with one hand or adaptive controllers cannot interact.",
      "fix_suggestion_nl": "Bied single-tap of button-gebaseerde alternatieven voor multi-touch gebaren (swipe, pinch, etc.).",
      "fix_suggestion_en": "Offer single-tap or button-based alternatives for multi-touch gestures (swipe, pinch, etc.).",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-040",
      "legacy_id": "sm10",
      "module": "accessibility",
      "subcategory": "semantics",
      "question_nl": "Kan een pointer-actie afgebroken worden? (WCAG 2.5.2)",
      "question_en": "Can a pointer action be aborted? (WCAG 2.5.2)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Acties die afgaan op pointer-down zijn moeilijk om niet aan te raken, specifieltly voor gebruikers met motorische beperkingen.",
      "business_impact_en": "Actions triggered on pointer-down are difficult to avoid, especially for users with motor disabilities.",
      "fix_suggestion_nl": "Zorg dat acties alleen afgaan op pointer-up, niet on-down. Sta gebruikers toe om weg te bewegen en los te laten zonder actie.",
      "fix_suggestion_en": "Ensure actions trigger on pointer-up, not on-down. Let users move away and release without triggering action.",
      "effort": "low",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-041",
      "legacy_id": "sm11",
      "module": "accessibility",
      "subcategory": "semantics",
      "question_nl": "Komt de accessible name overeen met de zichtbare labeltekst? (WCAG 2.5.3)",
      "question_en": "Does the accessible name match the visible label text? (WCAG 2.5.3)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Niet-overeenkomende namen veroorzaken verwarring voor schermlezer-gebruikers bij spraakbestuur.",
      "business_impact_en": "Mismatched names cause confusion for screen reader users with voice control.",
      "fix_suggestion_nl": "Zorg dat ARIA-labels of accessible names exact overeenkomen met zichtbare label-tekst.",
      "fix_suggestion_en": "Ensure ARIA labels or accessible names exactly match visible label text.",
      "effort": "low",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-042",
      "legacy_id": "sm12",
      "module": "accessibility",
      "subcategory": "semantics",
      "question_nl": "Is er geen functionaliteit die alleen via device-motion werkt? (WCAG 2.5.4)",
      "question_en": "Is there no functionality that only works via device-motion? (WCAG 2.5.4)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Motion-only controles zijn ontoegankelijk voor gebruikers op stationaire apparaten of met motor-beperkingen.",
      "business_impact_en": "Motion-only controls are inaccessible to users on stationary devices or with motor disabilities.",
      "fix_suggestion_nl": "Bied button-gebaseerde alternatieven voor motion-gebaseerde acties (schudden, kantelen, etc.).",
      "fix_suggestion_en": "Offer button-based alternatives for motion-based actions (shake, tilt, etc.).",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-043",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "visual",
      "question_nl": "Hebben niet-tekstuele content en UI-componenten voldoende contrast? (WCAG 1.4.11)",
      "question_en": "Do non-text content and UI components have sufficient contrast? (WCAG 1.4.11)",
      "type": "semi-auto",
      "severity": "important",
      "business_impact_nl": "Lage contrast in UI-componenten maakt interactieve elementen moeilijk identificeerbaar.",
      "business_impact_en": "Low contrast in UI components makes interactive elements hard to identify.",
      "fix_suggestion_nl": "Zorg dat alle UI-elementen (borders, icons, disabled state indicators) een contrastverhouding van minstens 3:1 hebben.",
      "fix_suggestion_en": "Ensure all UI elements (borders, icons, disabled state indicators) have a contrast ratio of at least 3:1.",
      "effort": "medium",
      "applicable_to": ["all"],
      "auto_tool": "lighthouse",
      "auto_metric": "non-text-contrast"
    },
    {
      "id": "a11y-044",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "visual",
      "question_nl": "Kan tekst spacing aangepast worden zonder verlies van functionaliteit? (WCAG 1.4.12)",
      "question_en": "Can text spacing be adjusted without loss of functionality? (WCAG 1.4.12)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Vaste tekst-afstanden kunnen leesbaarheid verminderen voor gebruikers met dyslexie.",
      "business_impact_en": "Fixed text spacing can reduce readability for users with dyslexia.",
      "fix_suggestion_nl": "Zorg dat tekst spacing aanpasbaar is via browser-instellingen zonder dat layout breekt. Test met: line-height: 1.5, letter-spacing: 0.12em, word-spacing: 0.16em.",
      "fix_suggestion_en": "Ensure text spacing can be adjusted via browser settings without breaking layout. Test with: line-height: 1.5, letter-spacing: 0.12em, word-spacing: 0.16em.",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-045",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "visual",
      "question_nl": "Reflowed content bij 320px width zonder horizontaal scrollen? (WCAG 1.4.10)",
      "question_en": "Does content reflow at 320px width without horizontal scrolling? (WCAG 1.4.10)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Horizontaal scrollen is irritant op kleine schermen en problematisch voor gebruikers met laag zicht.",
      "business_impact_en": "Horizontal scrolling is annoying on small screens and problematic for low vision users.",
      "fix_suggestion_nl": "Test responsive design bij 320px viewport. Zorg dat content 1-koloms reflows zonder horizontaal scroll.",
      "fix_suggestion_en": "Test responsive design at 320px viewport. Ensure content reflows to single column without horizontal scroll.",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-046",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "visual",
      "question_nl": "Hebben alle afbeeldingen passende alt-tekst? (WCAG 1.1.1)",
      "question_en": "Do all images have appropriate alt text? (WCAG 1.1.1)",
      "type": "auto",
      "severity": "critical",
      "business_impact_nl": "Afbeeldingen zonder alt-tekst zijn ontoegankelijk voor blinde en slechtziende gebruikers.",
      "business_impact_en": "Images without alt text are inaccessible to blind and low vision users.",
      "fix_suggestion_nl": "Voeg alt-attributen toe aan alle <img> tags. Zorg dat alt-tekst betekenisvol is en inhoud beschrijft.",
      "fix_suggestion_en": "Add alt attributes to all <img> tags. Ensure alt text is meaningful and describes content.",
      "effort": "low",
      "applicable_to": ["all"],
      "auto_tool": "axe-core",
      "auto_rule": "image-alt"
    },
    {
      "id": "a11y-047",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "visual",
      "question_nl": "Hebben alle links beschrijvende linktekst? (WCAG 2.4.4)",
      "question_en": "Do all links have descriptive link text? (WCAG 2.4.4)",
      "type": "auto",
      "severity": "important",
      "business_impact_nl": "Generieke linktekst (bijv. 'Klik hier') is onbegrijpelijk voor schermlezer-gebruikers.",
      "business_impact_en": "Generic link text (e.g., 'Click here') is incomprehensible to screen reader users.",
      "fix_suggestion_nl": "Vervang 'Klik hier' linktekst met beschrijvende tekst die aangeeft waarheen link gaat. Bv: 'Lees meer over onze diensten'.",
      "fix_suggestion_en": "Replace 'Click here' link text with descriptive text indicating where link goes. E.g., 'Read more about our services'.",
      "effort": "low",
      "applicable_to": ["all"],
      "auto_tool": "axe-core",
      "auto_rule": "link-name"
    },
    {
      "id": "a11y-048",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "keyboard",
      "question_nl": "Zijn tabindex waarden correct gebruikt? (WCAG 2.1.1)",
      "question_en": "Are tabindex values used correctly? (WCAG 2.1.1)",
      "type": "auto",
      "severity": "important",
      "business_impact_nl": "Onjuiste tabindex-waarden verstoren toetsenbord-navigatie.",
      "business_impact_en": "Incorrect tabindex values disrupt keyboard navigation.",
      "fix_suggestion_nl": "Vermijd tabindex > 0. Zorg dat tabindex-waarden logisch volgorde volgen en geen negatieve impact hebben op focus-beheer.",
      "fix_suggestion_en": "Avoid tabindex > 0. Ensure tabindex values follow logical order and don't negatively impact focus management.",
      "effort": "low",
      "applicable_to": ["all"],
      "auto_tool": "axe-core",
      "auto_rule": "tabindex"
    },
    {
      "id": "a11y-049",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "keyboard",
      "question_nl": "Zijn accesskeys uniek en niet conflicterend? (WCAG 2.1.1)",
      "question_en": "Are accesskeys unique and non-conflicting? (WCAG 2.1.1)",
      "type": "auto",
      "severity": "important",
      "business_impact_nl": "Conflicterende accesskeys interferen met browser en AT-shortcuts.",
      "business_impact_en": "Conflicting accesskeys interfere with browser and AT shortcuts.",
      "fix_suggestion_nl": "Vermijd accesskeys of zorg dat ze uniek zijn en niet conflicteren met standaard browser-shortcuts.",
      "fix_suggestion_en": "Avoid accesskeys or ensure they are unique and don't conflict with standard browser shortcuts.",
      "effort": "low",
      "applicable_to": ["all"],
      "auto_tool": "axe-core",
      "auto_rule": "accesskeys"
    },
    {
      "id": "a11y-050",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "keyboard",
      "question_nl": "Is focus niet beperkt tot specifieke regio's? (WCAG 2.4.11)",
      "question_en": "Is focus not restricted to specific regions? (WCAG 2.4.11)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Focus-beperking verhindert toetsenbordgebruikers andere pagina-elementen te bereiken.",
      "business_impact_en": "Focus restriction prevents keyboard users from reaching other page elements.",
      "fix_suggestion_nl": "Vermijd focus-locks op modals of specifieke regio's. Toestaan dat focus naar alle interactieve elementen kan gaan.",
      "fix_suggestion_en": "Avoid focus locks on modals or specific regions. Allow focus to move to all interactive elements.",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-051",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "keyboard",
      "question_nl": "Heeft focus-indicator minimale afmetingen en zichtbaarheid? (WCAG 2.4.12)",
      "question_en": "Does focus indicator have minimum size and visibility? (WCAG 2.4.12)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Te kleine of onzichtbare focus-indicator bemoeilijkt toetsenbordnavigatie.",
      "business_impact_en": "Too small or invisible focus indicator hampers keyboard navigation.",
      "fix_suggestion_nl": "Zorg dat focus-indicator minstens 2px dik is en een contrastverhouding van ≥3:1 heeft tegen achtergrond.",
      "fix_suggestion_en": "Ensure focus indicator is at least 2px thick and has ≥3:1 contrast ratio against background.",
      "effort": "low",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-052",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "keyboard",
      "question_nl": "Verandert context niet bij focus of input? (WCAG 3.2.1 / 3.2.2)",
      "question_en": "Does context not change on focus or input? (WCAG 3.2.1 / 3.2.2)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Onverwachte context-veranderingen (submit op focus) verwarren toetsenbordgebruikers.",
      "business_impact_en": "Unexpected context changes (submit on focus) confuse keyboard users.",
      "fix_suggestion_nl": "Vermijd automatische form-submissions bij focus of input-verandering. Vereisen explicit user action (button click).",
      "fix_suggestion_en": "Avoid automatic form submissions on focus or input change. Require explicit user action (button click).",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-053",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "media",
      "question_nl": "Hebben video's minstens ondertiteling of transcriptie? (WCAG 1.2.2)",
      "question_en": "Do videos have at least captions or transcription? (WCAG 1.2.2)",
      "type": "auto",
      "severity": "critical",
      "business_impact_nl": "Video's zonder captions/transcriptie zijn ontoegankelijk voor dove en slechthorende gebruikers.",
      "business_impact_en": "Videos without captions/transcription are inaccessible to deaf and hard of hearing users.",
      "fix_suggestion_nl": "Voeg captions of transcriptie toe aan alle video's.",
      "fix_suggestion_en": "Add captions or transcription to all videos.",
      "effort": "high",
      "applicable_to": ["all"],
      "auto_tool": "axe-core",
      "auto_rule": "video-caption"
    },
    {
      "id": "a11y-054",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "media",
      "question_nl": "Hebben audio-elementen ondertiteling of transcriptie? (WCAG 1.2.1)",
      "question_en": "Do audio elements have captions or transcription? (WCAG 1.2.1)",
      "type": "auto",
      "severity": "critical",
      "business_impact_nl": "Audio zonder captions/transcriptie is ontoegankelijk voor dove gebruikers.",
      "business_impact_en": "Audio without captions/transcription is inaccessible to deaf users.",
      "fix_suggestion_nl": "Voeg ondertiteling of transcriptie toe aan alle audio-elementen.",
      "fix_suggestion_en": "Add captions or transcription to all audio elements.",
      "effort": "high",
      "applicable_to": ["all"],
      "auto_tool": "axe-core",
      "auto_rule": "audio-caption"
    },
    {
      "id": "a11y-055",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "media",
      "question_nl": "Hebben pre-recorded video's audiodescriptie en gebarentaal? (WCAG 1.2.5 / 1.2.6)",
      "question_en": "Do pre-recorded videos have audio description and sign language? (WCAG 1.2.5 / 1.2.6)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Audiodescriptie maakt video's toegankelijk voor blinde en slechtziende gebruikers.",
      "business_impact_en": "Audio description makes videos accessible to blind and low vision users.",
      "fix_suggestion_nl": "Voeg audiodescriptie toe aan video's met belangrijk visueel content. Voeg gebarentaal-video toe voor dove gebruikers.",
      "fix_suggestion_en": "Add audio description to videos with important visual content. Add sign language video for deaf users.",
      "effort": "high",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-056",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "media",
      "question_nl": "Hebben pre-recorded audio's uitgebreide audiodescriptie? (WCAG 1.2.7)",
      "question_en": "Do pre-recorded audio have extended audio description? (WCAG 1.2.7)",
      "type": "manual",
      "severity": "minor",
      "business_impact_nl": "Uitgebreide audiodescriptie (AAA-level) verbetert toegankelijkheid voor blinde gebruikers.",
      "business_impact_en": "Extended audio description (AAA-level) improves accessibility for blind users.",
      "fix_suggestion_nl": "Voeg uitgebreide audiodescriptie toe aan audio-content. Dit kan als apart audio-bestand of teksttranscriptie.",
      "fix_suggestion_en": "Add extended audio description to audio content. This can be separate audio file or text transcript.",
      "effort": "high",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-057",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "forms",
      "question_nl": "Hebben alle formuliervelden correcte name-attributen? (WCAG 4.1.2)",
      "question_en": "Do all form fields have correct name attributes? (WCAG 4.1.2)",
      "type": "auto",
      "severity": "important",
      "business_impact_nl": "Form-velden zonder names zijn moeilijk te vullen voor schermlezer-gebruikers.",
      "business_impact_en": "Form fields without names are hard to fill for screen reader users.",
      "fix_suggestion_nl": "Zorg dat alle form-velden name-attributen hebben en gekoppeld zijn aan labels.",
      "fix_suggestion_en": "Ensure all form fields have name attributes and are associated with labels.",
      "effort": "low",
      "applicable_to": ["all"],
      "auto_tool": "axe-core",
      "auto_rule": "select-name"
    },
    {
      "id": "a11y-058",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "forms",
      "question_nl": "Is het lang-attribuut geldig? (WCAG 3.1.1)",
      "question_en": "Is the lang attribute valid? (WCAG 3.1.1)",
      "type": "auto",
      "severity": "important",
      "business_impact_nl": "Ongeldig lang-attribuut kan schermlezers verwarren.",
      "business_impact_en": "Invalid lang attribute can confuse screen readers.",
      "fix_suggestion_nl": "Zorg dat lang-attributen geldige taalcodes zijn (bijv. 'nl', 'en', 'fr').",
      "fix_suggestion_en": "Ensure lang attributes use valid language codes (e.g., 'nl', 'en', 'fr').",
      "effort": "low",
      "applicable_to": ["all"],
      "auto_tool": "axe-core",
      "auto_rule": "html-lang-valid"
    },
    {
      "id": "a11y-059",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "forms",
      "question_nl": "Is foutpreventie geïmplementeerd voor juridische/financiële acties? (WCAG 3.3.6)",
      "question_en": "Is error prevention implemented for legal/financial actions? (WCAG 3.3.6)",
      "type": "manual",
      "severity": "critical",
      "business_impact_nl": "Zonder foutpreventie kunnen gebruikers per ongeluk kritieke acties uitvoeren.",
      "business_impact_en": "Without error prevention, users can accidentally perform critical actions.",
      "fix_suggestion_nl": "Implementeer preview, confirmation dialogs, of undo voor juridische/financiële transacties.",
      "fix_suggestion_en": "Implement preview, confirmation dialogs, or undo for legal/financial transactions.",
      "effort": "high",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-060",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "forms",
      "question_nl": "Is redundante invoer geminimaliseerd? (WCAG 3.3.7)",
      "question_en": "Is redundant entry minimized? (WCAG 3.3.7)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Redundante invoer-velden frustreren gebruikers, vooral die met motorische beperkingen.",
      "business_impact_en": "Redundant entry fields frustrate users, especially those with motor disabilities.",
      "fix_suggestion_nl": "Minimaliseer herhaalde veldwaarden. Gebruik autofill, prefilled waarden, of stap-voor-stap formulieren.",
      "fix_suggestion_en": "Minimize repeated field values. Use autofill, prefilled values, or step-by-step forms.",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-061",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "forms",
      "question_nl": "Is toestemmingsauthenticatie toegankelijk? (WCAG 3.3.8)",
      "question_en": "Is authentication accessible? (WCAG 3.3.8)",
      "type": "manual",
      "severity": "critical",
      "business_impact_nl": "Ontoegankelijke login/authenticatie sluit gebruikers buiten.",
      "business_impact_en": "Inaccessible login/authentication locks users out.",
      "fix_suggestion_nl": "Zorg dat login-formulieren volledig toetsenbord-toegankelijk zijn. Vermijd CAPTCHA's of zorg voor alternatieven (audio CAPTCHA, etc.).",
      "fix_suggestion_en": "Ensure login forms are fully keyboard accessible. Avoid CAPTCHAs or provide alternatives (audio CAPTCHA, etc.).",
      "effort": "high",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-062",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "semantics",
      "question_nl": "Heeft de pagina minstens één <main> landmark? (WCAG 2.4.1)",
      "question_en": "Does the page have at least one <main> landmark? (WCAG 2.4.1)",
      "type": "auto",
      "severity": "important",
      "business_impact_nl": "Zonder <main> landmark kunnen schermlezer-gebruikers niet snel naar inhoud springen.",
      "business_impact_en": "Without <main> landmark, screen reader users cannot quickly jump to content.",
      "fix_suggestion_nl": "Voeg één <main> element toe aan de pagina, inclusief primaire inhoud.",
      "fix_suggestion_en": "Add one <main> element to the page, wrapping primary content.",
      "effort": "low",
      "applicable_to": ["all"],
      "auto_tool": "axe-core",
      "auto_rule": "landmark-one-main"
    },
    {
      "id": "a11y-063",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "semantics",
      "question_nl": "Zijn alle content-regio's gemarkeerd met landmarks? (WCAG 1.3.1)",
      "question_en": "Are all content regions marked with landmarks? (WCAG 1.3.1)",
      "type": "auto",
      "severity": "important",
      "business_impact_nl": "Unmarked regions maken het lastig voor schermlezer-gebruikers pagina-structuur te begrijpen.",
      "business_impact_en": "Unmarked regions make it hard for screen reader users to understand page structure.",
      "fix_suggestion_nl": "Gebruik landmarks (<header>, <nav>, <main>, <aside>, <footer>) voor duidelijke structuur.",
      "fix_suggestion_en": "Use landmarks (<header>, <nav>, <main>, <aside>, <footer>) for clear structure.",
      "effort": "low",
      "applicable_to": ["all"],
      "auto_tool": "axe-core",
      "auto_rule": "region"
    },
    {
      "id": "a11y-064",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "semantics",
      "question_nl": "Zijn lijsten semantisch correct gemarkeerd? (WCAG 1.3.1)",
      "question_en": "Are lists semantically marked correctly? (WCAG 1.3.1)",
      "type": "auto",
      "severity": "important",
      "business_impact_nl": "Niet-semantische lijsten ondermijnen schermlezer-navigatie.",
      "business_impact_en": "Non-semantic lists undermine screen reader navigation.",
      "fix_suggestion_nl": "Gebruik <ul>, <ol>, en <li> voor daadwerkelijke lijsten, niet <div> of <p>.",
      "fix_suggestion_en": "Use <ul>, <ol>, and <li> for actual lists, not <div> or <p>.",
      "effort": "low",
      "applicable_to": ["all"],
      "auto_tool": "axe-core",
      "auto_rule": "list"
    },
    {
      "id": "a11y-065",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "semantics",
      "question_nl": "Staan lijstitems alleen in lijsten? (WCAG 1.3.1)",
      "question_en": "Are list items only in lists? (WCAG 1.3.1)",
      "type": "auto",
      "severity": "important",
      "business_impact_nl": "Orphaned <li> elementen buiten <ul>/<ol> verwarren schermlezers.",
      "business_impact_en": "Orphaned <li> elements outside <ul>/<ol> confuse screen readers.",
      "fix_suggestion_nl": "Zorg dat alle <li> elementen in <ul> of <ol> staan.",
      "fix_suggestion_en": "Ensure all <li> elements are within <ul> or <ol>.",
      "effort": "low",
      "applicable_to": ["all"],
      "auto_tool": "axe-core",
      "auto_rule": "listitem"
    },
    {
      "id": "a11y-066",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "semantics",
      "question_nl": "Hebben iframes beschrijvende titels? (WCAG 1.3.1 / 2.4.1)",
      "question_en": "Do iframes have descriptive titles? (WCAG 1.3.1 / 2.4.1)",
      "type": "auto",
      "severity": "important",
      "business_impact_nl": "Iframes zonder titels zijn navigeerbaar voor schermlezer-gebruikers.",
      "business_impact_en": "Iframes without titles are not navigable for screen reader users.",
      "fix_suggestion_nl": "Voeg title-attributen toe aan alle <iframe> elementen met beschrijvende tekst.",
      "fix_suggestion_en": "Add title attributes to all <iframe> elements with descriptive text.",
      "effort": "low",
      "applicable_to": ["all"],
      "auto_tool": "axe-core",
      "auto_rule": "frame-title"
    },
    {
      "id": "a11y-067",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "semantics",
      "question_nl": "Zijn er geen duplicate IDs op de pagina? (WCAG 4.1.1)",
      "question_en": "Are there no duplicate IDs on the page? (WCAG 4.1.1)",
      "type": "auto",
      "severity": "important",
      "business_impact_nl": "Duplicate IDs kunnen label-associations en JavaScript-functionaliteit verstoren.",
      "business_impact_en": "Duplicate IDs can break label associations and JavaScript functionality.",
      "fix_suggestion_nl": "Zorg dat alle ID-attributen uniek zijn op de pagina.",
      "fix_suggestion_en": "Ensure all ID attributes are unique on the page.",
      "effort": "low",
      "applicable_to": ["all"],
      "auto_tool": "axe-core",
      "auto_rule": "duplicate-id-active"
    },
    {
      "id": "a11y-068",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "semantics",
      "question_nl": "Is navigatie consistent over pagina's heen? (WCAG 3.2.3)",
      "question_en": "Is navigation consistent across pages? (WCAG 3.2.3)",
      "type": "semi-auto",
      "severity": "important",
      "business_impact_nl": "Inconsistente navigatie verwart gebruikers en bemoeilijkt site-navigatie.",
      "business_impact_en": "Inconsistent navigation confuses users and hinders site navigation.",
      "fix_suggestion_nl": "Zorg dat navigatiemenu's, plaatsing, en stijlen consistent zijn op alle pagina's.",
      "fix_suggestion_en": "Ensure navigation menus, placement, and styling are consistent across all pages.",
      "effort": "medium",
      "applicable_to": ["all"],
      "auto_tool": "lighthouse",
      "auto_metric": "consistent-navigation"
    },
    {
      "id": "a11y-069",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "semantics",
      "question_nl": "Zijn componenten consistent identificeerbaar? (WCAG 3.2.4)",
      "question_en": "Are components consistently identified? (WCAG 3.2.4)",
      "type": "semi-auto",
      "severity": "important",
      "business_impact_nl": "Inconsistente component-identificatie verwart gebruikers.",
      "business_impact_en": "Inconsistent component identification confuses users.",
      "fix_suggestion_nl": "Zorg dat dezelfde componenten dezelfde labels en presentatie hebben over pagina's heen.",
      "fix_suggestion_en": "Ensure same components have same labels and presentation across pages.",
      "effort": "medium",
      "applicable_to": ["all"],
      "auto_tool": "lighthouse",
      "auto_metric": "consistent-identification"
    },
    {
      "id": "a11y-070",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "semantics",
      "question_nl": "Is sleepen/slepen niet het enige middel voor interactie? (WCAG 2.5.7)",
      "question_en": "Is dragging not the only means of interaction? (WCAG 2.5.7)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Drag-only interfaces zijn ontoegankelijk voor gebruikers met motorische beperkingen.",
      "business_impact_en": "Drag-only interfaces are inaccessible to users with motor disabilities.",
      "fix_suggestion_nl": "Bied button/select-gebaseerde alternatieven voor drag-and-drop functionaliteit.",
      "fix_suggestion_en": "Offer button/select-based alternatives for drag-and-drop functionality.",
      "effort": "high",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-071",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "semantics",
      "question_nl": "Hebben interactieve targets minimale grootte van 24x24px? (WCAG 2.5.8)",
      "question_en": "Do interactive targets have minimum size of 24x24px? (WCAG 2.5.8)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Kleine targets zijn moeilijk aan te raken, vooral op mobiele apparaten.",
      "business_impact_en": "Small targets are hard to tap, especially on mobile devices.",
      "fix_suggestion_nl": "Zorg dat alle clickable/tappable elementen minstens 24x24px groot zijn. Voeg padding toe waar nodig.",
      "fix_suggestion_en": "Ensure all clickable/tappable elements are at least 24x24px. Add padding if needed.",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-072",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "visual",
      "question_nl": "Is de pagina leesbaar bij zwart-witweergave? (contrast-check)",
      "question_en": "Is the page readable in grayscale? (contrast-check)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Grijs-geschakeld design helpt verifiëren dat contrast niet alleen op kleur berust.",
      "business_impact_en": "Grayscale design helps verify contrast isn't only color-based.",
      "fix_suggestion_nl": "Test pagina in grayscale-modus. Zorg dat alle informatie nog zichtbaar is zonder kleur.",
      "fix_suggestion_en": "Test page in grayscale mode. Ensure all information is still visible without color.",
      "effort": "low",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-073",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "forms",
      "question_nl": "Ondersteunt het formulier browserauto-fill? (WCAG 1.3.5)",
      "question_en": "Does the form support browser autofill? (WCAG 1.3.5)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Auto-fill ondersteuning versnelt formulierinvulling voor alle gebruikers.",
      "business_impact_en": "Autofill support speeds up form filling for all users.",
      "fix_suggestion_nl": "Voeg autocomplete-attributen toe aan form-velden (name, email, tel, address, etc.).",
      "fix_suggestion_en": "Add autocomplete attributes to form fields (name, email, tel, address, etc.).",
      "effort": "low",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-074",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "media",
      "question_nl": "Worden alle media's gepauzeerd bij verlies van focus? (WCAG 1.4.2)",
      "question_en": "Do all media pause when focus is lost? (WCAG 1.4.2)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Autoplay media die niet onderbreken kunnen schermlezer-audio overstemmen.",
      "business_impact_en": "Autoplay media that don't pause can drown out screen reader audio.",
      "fix_suggestion_nl": "Zorg dat alle audio/video pauzeert wanneer pagina focus verliest.",
      "fix_suggestion_en": "Ensure all audio/video pauses when page loses focus.",
      "effort": "low",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-075",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "keyboard",
      "question_nl": "Kunnen gebruikers focus-order omdraaien met Shift+Tab? (WCAG 2.1.1)",
      "question_en": "Can users reverse focus order with Shift+Tab? (WCAG 2.1.1)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Shift+Tab ondersteuning is essentieel voor bidirectionele toetsenbordnavigatie.",
      "business_impact_en": "Shift+Tab support is essential for bidirectional keyboard navigation.",
      "fix_suggestion_nl": "Zorg dat Shift+Tab correct teruggaat in focus-order zonder keyboard traps.",
      "fix_suggestion_en": "Ensure Shift+Tab correctly goes back in focus order without keyboard traps.",
      "effort": "low",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-076",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "visual",
      "question_nl": "Zijn decoratieve afbeeldingen gemarkeerd met alt=''? (WCAG 1.1.1)",
      "question_en": "Are decorative images marked with alt=''? (WCAG 1.1.1)",
      "type": "manual",
      "severity": "minor",
      "business_impact_nl": "Niet-gelabelde decoratieve afbeeldingen creëren ruis in schermlezer-uitvoer.",
      "business_impact_en": "Unlabeled decorative images create noise in screen reader output.",
      "fix_suggestion_nl": "Markeer decoratieve <img> met alt='' (leeg alt-attribuut) of role='presentation'.",
      "fix_suggestion_en": "Mark decorative <img> with alt='' (empty alt attribute) or role='presentation'.",
      "effort": "low",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-077",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "semantics",
      "question_nl": "Zijn <button> en <a> elementen correct gebruikt? (WCAG 2.4.9)",
      "question_en": "Are <button> and <a> elements used correctly? (WCAG 2.4.9)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Onjuist gebruik van <a> voor acties in plaats van navigatie is verwarrend.",
      "business_impact_en": "Incorrect use of <a> for actions instead of navigation is confusing.",
      "fix_suggestion_nl": "Gebruik <a> voor navigatie (href), <button> voor acties (onClick).",
      "fix_suggestion_en": "Use <a> for navigation (href), <button> for actions (onClick).",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-078",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "forms",
      "question_nl": "Zijn <fieldset> en <legend> correct gebruikt voor grouping? (WCAG 3.3.2)",
      "question_en": "Are <fieldset> and <legend> used correctly for grouping? (WCAG 3.3.2)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Correct fieldset/legend gebruik helpt schermlezer-gebruikers form-groepering begrijpen.",
      "business_impact_en": "Correct fieldset/legend use helps screen reader users understand form grouping.",
      "fix_suggestion_nl": "Gebruik <fieldset> + <legend> voor logische form-groepen (bijv. radiobuttongroepen).",
      "fix_suggestion_en": "Use <fieldset> + <legend> for logical form groups (e.g., radio button groups).",
      "effort": "low",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-079",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "visual",
      "question_nl": "Is het contrast ratio ≥7:1 voor AAA-compliantie? (WCAG 1.4.6 AAA)",
      "question_en": "Is contrast ratio ≥7:1 for AAA compliance? (WCAG 1.4.6 AAA)",
      "type": "manual",
      "severity": "minor",
      "business_impact_nl": "AAA-level contrast (7:1) biedt excellent leesbaarheid voor extreme low-vision gebruikers.",
      "business_impact_en": "AAA-level contrast (7:1) provides excellent readability for extreme low-vision users.",
      "fix_suggestion_nl": "Verhoog contrast tot 7:1 voor AAA-compliantie waar mogelijk.",
      "fix_suggestion_en": "Increase contrast to 7:1 for AAA compliance where possible.",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-080",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "keyboard",
      "question_nl": "Kunnen gebruikers het toetsenbord deaktiveringsgedrag overridden? (WCAG 2.1.3 AAA)",
      "question_en": "Can users override keyboard disabling behavior? (WCAG 2.1.3 AAA)",
      "type": "manual",
      "severity": "minor",
      "business_impact_nl": "AAA-level ondersteuning voor toetsenbord-override geeft geavanceerde AT-users meer controle.",
      "business_impact_en": "AAA-level support for keyboard override gives advanced AT users more control.",
      "fix_suggestion_nl": "Zorg dat toetsenbord niet kan worden uitgeschakeld, of sta override toe.",
      "fix_suggestion_en": "Ensure keyboard cannot be disabled, or allow user override.",
      "effort": "low",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-081",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "media",
      "question_nl": "Worden media-controls zelf toegankelijk gemaakt? (WCAG 1.3.1)",
      "question_en": "Are media controls themselves accessible? (WCAG 1.3.1)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Ontoegankelijke media-controls voorkomen dat gebruikers media kunnen beheren.",
      "business_impact_en": "Inaccessible media controls prevent users from managing media.",
      "fix_suggestion_nl": "Zorg dat play/pause/volume/fullscreen knoppen toetsenbord-bereikbaar zijn en duidelijke labels hebben.",
      "fix_suggestion_en": "Ensure play/pause/volume/fullscreen buttons are keyboard-reachable with clear labels.",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-082",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "forms",
      "question_nl": "Hebben multi-stap formulieren duidelijke voortgangsindicatoren? (WCAG 3.3.1)",
      "question_en": "Do multi-step forms have clear progress indicators? (WCAG 3.3.1)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Voortgangsindicatoren helpen gebruikers hun voortgang in multi-stap formulieren te volgen.",
      "business_impact_en": "Progress indicators help users track their progress in multi-step forms.",
      "fix_suggestion_nl": "Voeg stap-indicatoren toe (bijv. '1 van 5') en duiden de huidige stap duidelijk aan.",
      "fix_suggestion_en": "Add step indicators (e.g., '1 of 5') and clearly mark the current step.",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-083",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "semantics",
      "question_nl": "Worden externe links duidelijk gemarkeerd? (WCAG 3.2.4)",
      "question_en": "Are external links clearly marked? (WCAG 3.2.4)",
      "type": "manual",
      "severity": "minor",
      "business_impact_nl": "Duidelijke markering van externe links helpt gebruikers verwachtingen te managen.",
      "business_impact_en": "Clear marking of external links helps users manage expectations.",
      "fix_suggestion_nl": "Voeg pictogram of tekstindicatie toe aan externe links (bijv. '(opent in nieuw tabblad)').",
      "fix_suggestion_en": "Add icon or text indication to external links (e.g., '(opens in new tab)').",
      "effort": "low",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-084",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "keyboard",
      "question_nl": "Is toetsenbord focus zichtbaar in alle browser-modus's? (WCAG 2.4.7)",
      "question_en": "Is keyboard focus visible in all browser modes? (WCAG 2.4.7)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Zichtbare focus in alle modes is essentieel voor toetsenbordnavigatie.",
      "business_impact_en": "Visible focus in all modes is essential for keyboard navigation.",
      "fix_suggestion_nl": "Test focus visibility in fullscreen, dark mode, high contrast mode.",
      "fix_suggestion_en": "Test focus visibility in fullscreen, dark mode, high contrast mode.",
      "effort": "medium",
      "applicable_to": ["all"]
    },
    {
      "id": "a11y-085",
      "legacy_id": null,
      "module": "accessibility",
      "subcategory": "visual",
      "question_nl": "Is redactioneren van content ontoegankelijk gemaakt? (WCAG 1.4.11)",
      "question_en": "Is redacted content made inaccessible? (WCAG 1.4.11)",
      "type": "manual",
      "severity": "important",
      "business_impact_nl": "Redacted content moet ook voor schermlezers geredact zijn.",
      "business_impact_en": "Redacted content must also be redacted for screen readers.",
      "fix_suggestion_nl": "Zorg dat geredacteerde content verborgen is via aria-hidden of display:none, niet alleen visueel geredact.",
      "fix_suggestion_en": "Ensure redacted content is hidden via aria-hidden or display:none, not just visually redacted.",
      "effort": "low",
      "applicable_to": ["all"]
    }
  ]
}
